02-Acoustic-case1/3DRoomAcoustic/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices (
 (0 0 0) //0
 (12 0 0)//1
 (12 6 0)//2
 (0 6 0)//3
 (0 0 12)//4
 (12 0 12)//5
 (12 6 12)//6
 (0 6 12)//7
);


blocks (
 hex (0 1 2 3 4 5 6 7) (90 45 90) simpleGrading (
(
 (.2 .2 2)
 (.3 .3 .5)
 (.3 .3 2)
 (.2 .2 .5)
)
(
 (.2 .2 2)
 (.3 .3 .5)
 (.3 .3 2)
 (.2 .2 .5)
)
(
  (.2 .2 2)
  (.3 .3 .5)
  (.3 .3 2)
  (.2 .2 .5)
  )
  )

);

edges 
(
);

boundary 
(
 fixedWalls 
 {
	type wall;
 	faces
 	(
  	(1 2 6 5)
  	(2 3 7 6)
  	(4 7 3 0)
  	(0 1 5 4)
        (0 3 2 1) //bottom
        (4 5 6 7)//top
 	); 
}

frontAndBack
{
 type empty;
 faces
 (
 ); 
}
);

mergePatchPairs
(
);
// ************************************************************************* //


