02-Acoustic-case1/3DRoomAcoustic/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication setFields
runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar

